#คำนวณราคาขายสินค้า โดยรับซื้อสินค้า และราคาสินค้า(ต้นทุน) ทางแป้นพิมพ์
#แล้วคำนวณหาราคาขายของสินค้า โดยราคาขายสินค้าจะคิดเพิ่มจากราคาสินค้า (ต้นทุน) ร้อยละ 10
#สูตร ราคาขายสินค้า = ราคาสินค้า(ต้นทุน) + (ราคาสินค้า(ต้นทุน) * 10 / 100)

#Feature ในการรับค่า การคำนวณ และการแสดงผลแยกจากกัน
#ดังนั้นอย่างน้อยมี 3 ฟังก์ชัน
#1.ราคาขายสินค้า 2.ราคาสินค้าต้นทุน 3.ราคาขายสินค้าจะคิดเพิ่มจากราคาสินค้า (ต้นทุน) ร้อยละ 10


def func1( ) :
    P_N = input('ป้อนชื่อสินค้า : ') 
    P_P = float( input('ป้อนราคาต้นทุนสินค้า : ') )
    return P_N, P_P

def func2( P_P ) :
    P_S = P_P + (P_P * 10 / 100)
    return P_S
   
def ShowP_S(P_N, P_P, P_S) :
    print(f'ชื่อสินค้า {P_N}')
    print(f'ป้อนราคาต้นทุนสินค้า  {P_P} บาท')
    print(f'ราคาขายสินค้า {P_S} บาท')

print('........................................')
print('..............** PS **..................')
print('........................................')
P_N, P_P = func1( )
P_S = func2(P_P)
print('........................................')
ShowP_S( P_N, P_P, P_S)
print('........................................')